// 6) შექმენით arrow ფუნქცია რომელსაც გადაეცემა ორი პარამეტრი, მასივი და რიცხვი, თქვენი დავალებაა გადაუაროთ მასივს და ის 
// რიცცხვები დაამატოთ ახალ მასივში რომელიც გადმოცემულ რიცხვს არ უდრის, საბოლოოდ დააბრუნეთ ახალი მასივი (გამოიყენეთ arrow ფუნქცია)

const filter = (arr, number) => {
    const result = [];

    for (let i = 0; i < arr.length; i++) {
        if (arr[i] !== number) {
            result.push(arr[i]);
        };
    };

    return result;
};

console.log(filter([1, 2, 3, 4, 5], 3));

