// 1) თქვენი სიტყვებით ახსენით თუ რა არის npm, რაში გამოიყენება package.json და package-lock.json რა განსხავავებაა import/export სა 
// და module.exports/require - შორის რა არის node_modules, ყველაფერი ახსენით დეტალურად კომენტარების სახით და კარგად გაიაზრეთ

// 2) ვისაც არ დაგისრულებაით საკლასო დავალებები აუცილებლად დაასრულეთ

// 3) თქვენი სურვილით აირჩიეთ ორი პროექტი სადაც გამოიყენებთ რაიმე module - ებს

// 4) ივარჯიშეთ export/import - ზე node - ში

// npm (Node Package Manager) არის პაკეტების მენეჯერი, რომელიც გამოიყენება JavaScript პროექტებში, განსაკუთრებით Node.js გარემოში.
// package.json არის სამართავი ფაილი.
// package-lock.json - აქ არის მოცემული ინფორმაცია, თუ რომელ მოდულებზე არის დამოკიდებული ჩვენი პროექტი და მათი ზუსტი ვერსიები.
// import/export არის ES6 მოდულის სინტაქსი, რომელიც გამოიყენება მოდულების იმპორტირებისა და ექსპორტირებისთვის.
// module.exports/require არის CommonJS მოდულის სინტაქსი, რომელიც გამოიყენება Node.js გარემოში მოდულების იმპორტირებისა და ექსპორტირებისთვის.
// node_modules არის ფოლდერი სადაც არის თავმოყრილი ჩვენმიერ გადმოწერილი მოდულები.

import chalk from "chalk";

console.log(chalk.red("Hello world!"));