// 3) ახსენით რა არის type და enum და აგრეთვე მოიყვანეთ მაგალითი სად 
// შეიძლება დაგვჭირდეს

// enum - ით ჩვენ შეგვიძლია განვსაზღვროთ ის, თუ რა მნიშვნელობები 
// შეიძლება ჰქონდეს ცვლადს.
// enum - ი შეიძლება დაგვჭირდეს იმ დროს, როდესაც ჩვენ გვინდა რომ 
// ცვლადში შევინახოთ რაიმე კონკრეტული, შეზღუდული მნიშვნელობები.

// type - ით შეგვიძლია შევქმნათ ჩვენი საკუთარი მონაცემთა ტიპი, 
// შეიძლება იყოს ობიექტი, მასივი, სტრინგი, შერეული (ობიექტში ჩასმული 
// მასივები მაგალითად) და ა.შ.
// type - ი შეიძლება დაგვჭირდეს იმ დროს, როდესაც ჩვენ გვჭირდება 
// ჩვენთვის მოქნილი ობიექტის / მასივის შექმნა.
