// 1) src ფოლდერში შექმენით components ფოლდერი, მაგ ფოლდერში დაამატეთ 2 ფაილი სახელად Nav.jsx და Footer.jsx, შექმენით ამ ფაილებში ფუნქციური კომპონენტები, დააბრუნეთ შესაბამისი jsx ელემენტები და შემდეგ ეგ კომპონენტები დააიმპორტეთ App.jsx, გამოიძახეთ დაიმპორტებული კომპოინენტები  თეგების სახით მაგ <Nav /> <Footer />

function Nav() {
    return (
        <header>
            <nav>
                <ul>
                    <li>1</li>
                    <li>2</li>
                    <li>3</li>
                    <li>4</li>
                </ul>
            </nav>
        </header>
    )
}

export default Nav;

