// 1) შექმენით ობიექტი, სახელად account რომელსაც გააჩნია 3 კუთვნილება, email, pass, fullname,  იმეილის და პაროლის კუთვნილება უნდა 
// იყოს პირადული, შემდეგ შექმენით setter მეთოდი სახელად pass რომლის დახმარებითაც შეცვლით პაროლს, სანამ პაროლი შეიცვლება იქამდე 
// შეამოწმეთ ახალი პაროლის ზომა შედგება თუ არა მინიმუმ 6 სიმბოლოსოგან თუ შედგება შეცვალეთ და თუ არ შედგება დაბეჭდეთ კონსოლში 
// რომ პაროლის ზომა არ ემთვევა მინიმუმ 6 სიმბოლოს~, აგრეთვე შექმენით getter მეთოდი რომლის მეშვეობითაც დააბრუნებთ email და სააბოლოოდ 
// ჩვეულებრივი მეთოდი greet რომელიც დაბეჭდავს მე ვარ სახელი გვარი.

const account = {
    _email: "person@gmail.com",
    _pass: "pass123",
    fullname: "Saba Dzidzikashvili",

    set pass(password) {
        if (password.length < 6) {
            console.log("პაროლის ზომა უნდა იყოს მინიმუმ 6 სიმბოლო.");
        } else {
            _pass = password;
        };
    },

    get email() {
        return this._email;
    },

    greet() {
        console.log(`მე ვარ ${this.fullname}`);
    }
};

