// 1) შექმენით ობიექტი სახელად me, ობიექტში შექმენით მინიმუმ 5 კუთვნილება, firstname, lastname, age, city და თქვენტვის სასურვბელი დამატებითი კუთვნილება (ქართულად კომენტარებით ახსენიტ რა არის ოპბიექტი და რითი განსხვავდება მასივისაგან

const me = {
    firstName: "Saba",
    lastName: "Dzidzikashvili",
    age: 15,
    city: "Tbilisi",
    pet: true
}

// ობიექტი არის მასივის მსგავსი ელემენტი ჯავასკრიფტში, მათ შორის განსხვავება ის არის, რომ მასივში თითოეული ელემენტი არის დანომრილი რიცხვით (ინდექსით) და ობიექტში ჩვენთვითნ ვარქმევთ სახელს ობიექტის კუთვნილებას.
