// 3) შემოატანინეთ მომხმარებელს ასაკი, შეამოწმეთ თუ მომხმარებლის მიერ შემოტანილი მნიშვნელობა, ასაკი  არის მეტი 0 - ზე და ნაკლები ან ტოლი 13 - ზე 
// მაშინ alert - ის დახმარებით გამოიტანეთ რომ მომხმარებელი არის არასრულწლოვანი, იმ შემთხვევაში თუ მომხამრებლის მიერ შემოტანილი ასაკი მეტია ან ტოლი 
// 13 და ნაკლებია 18 - ზე მაშინ alert - ის დახმარებით აცნობეთ რომ ის არის თინეიჯერი, იმ შემთხვევაში თუ მომხამრებლის ასაკი მეტია ან ტოლი 18 - ის 
// გამოიტანეთ რომ ის არის სრულწლოვანი


const userAge = parseInt(prompt("გთხოვთ შეიყვანოთ თქვენი ასაკი"))

if(userAge > 0 && userAge <= 13) {
    alert("მომხმარებელი არის არასრულწლოვანი.")
} else if(userAge >= 13 && userAge < 18) {
    alert("მომხმარებელი არის თინეიჯერი.")
} else if(userAge >= 18) {
    alert("მომხმარებელი არის სრულწლოვანი.")
} else {
    alert("თქვენ მიუთითეთ არასწორი ასაკი.")
}