// 3) შექმენით ერთი ობიექტი მასში კი დაამტეთ რაიმე კუთვნილებები, თქვენი დავალებაა რომ destructing - ის გამოყენებით ამოიღოთ მხოლოდ 
// ორი კუთვნილება და შეინახოთ ცლადში, გამოიტანეთ console - ში, კომენტარების სახით ახსენით თუ რა არის დესტრუქცია, შეგვიძლია თუ 
// არა დესტრუქციის დროს შევუცვალოთ კუთვნილებას თავისი სახელი

const user = {
    name: "Saba",
    surename: "Dzidzikashvili",
    age: 16,
    country: "Georgia",
};

const {name, surename} = user;

console.log(name, surename);

// destuction - ი არის ობიექტიდან კუთვნილებების ამოღება ცვლადების სახით.