# 4) კომენტარის სახით დაწერეთ თუ რას ნიშნავს იტერაცია და რით განსხვავდება for და while ციკლი ერთმანეთისგან. დაწერე ორივე ციკლის თითო მაგალითი.

# იტერაცია არის კოდის გამეორება.

# While loop-ს ვიყენებთ იმ დროს, როდესაც ჩვენ არ ვიცით რამდენჯერ გვჭირდება კოდის გამეორება.
# for loop-ს ჩვენ ვიყენებთ იმ დროშ როდესაც ჩვენ ვიცით რამდენჯერ გვჭირდება კოდის გამეორება, ასევე ჩვენ შეგვიძლია, რომ გადაუაროთ რაიმე ლისტს ან სტრნიგს და რაღაცა მოქმედება შევასრულოთ მაგ ელემენტებზე.

# while loop
number = 10
count = 0

while count <= number:
    print(count)
    count += 1

print()

# for loop

for i in range(0, 11, 1):
    print(i)