// 3) შექმენით ფუნქცია სახელად filter რომელსაც გადაეცემა ორი არგუმენტი, პირველი არის ნებისმიერი ტიპის მასივი 
// (ვგუილისხმობ მასივი შეიძლება იყოს რიცხვების, სტრინგების და ასშ მაგრამ არ იქნება შერეული) მეორე არგუმენტი კი 
// იქნება ფუნქცია, პირველ პარამეტრს დაარქვით arr, მეორეს კი helper, მთავარ ფუნქციაში შექმენით ცარიელი მასივი, 
// შემდეგ გადაურეთ arr მასივს for ციკლით, ყველა მნიშვენლობაზე გამოიძახეთ რიგრიგობით helper ფუნქცია და შეამოწმეთ 
// helper ფუნქციის მიერ დაბრუნებული მნიშვნელობა უდრის თუ არა true, თუ უდრის მაშინ დაამატეთ გადაცემული 
// მნიშვნელობა ახალ მასივში, საბოლოოდ დააბრუნეთ ახალი მასივი filter ფუნქციიდან


// გამოძახებისთვის შექმენით ნებიუსმიერი ტიპის მასივი, და ფუნქცია რომელსაც თითოეული მნიშვნელობის შესამოწმებლად გამოიყენებთ მაგალითად

// მასივი [1,2,3,4,5]

// ფუნქცია: ამოწმებს არგუმენტად მიღებულ რიცხვის არის თუ არა ლუწი

// return num % 2 === 0

const filter = function(arr, helper) {
    const result = [];

    for (let i = 0; i < arr.length; i++) {
        if (helper(arr[i]) === true) {
            result.push(arr[i]);
        };
    };

    return result;
};

console.log(filter([1, 2, 3, 4, 5], function(value) {
    return value % 2 == 0;
}));

