// 28) შექმენით ობიექტი მასში შენახეთ ქყვეყანა და ქალაქი, შექმენით ერთი ცვლადი, შეინახეთ მასში რაიმე ქალაქის სახელი, შეამოწმეთ იმ 
// შემთხვევაში თუ თქვენს მიერ შექმნილი ცვალდის მნიშვნელობა არის შექმნილ ობიექტში, ანუ თუ თქვენ მიერ ჩაფიქრებული ქალაქი არის ობიექტში 
// არსებული ქალაქის ტოლი, მაშინ დააბრუნეთ true მნიშვნელობა სხვა შემთხვევაში კი false

const location = {
    country1: "საქართველო",
    city1: "თბილისი",
    country2: "რუსეთი",
    city2: "მოსკოვი"
};

const city = "თბილისი";

const values = Object.values(location);

console.log(values.includes(city) ? true : false);

