// 2) გამოიყენეთ readline და fs მოდულები, იმისათვის რომ ფაილიდან ინფორმაციის წაკითხვა შეგეძლოთ ოპტიმიზირებულად (შექმენით stream) ახსენით კომენტარებით რა არის stream და რატომ არის მისი გამოყენება უკეთესი და პრაქტიკული

const fs = require("fs");
const readline = require("readline");

const myStrim = readline.createInterface({
    input: fs.createReadStream("./level 117/classwork/result.txt")
});

myStrim.on("line", line => {
    console.log(line);
});

// stream არის მეთოდი ინფორმაციის გადაცემისათვის, რომელიც საშუალებას გვაძლევს ვიმუშაოთ მონაცემებთან ნაწილობრივ.

// მისი გამოყენება უკეთესია იმიტომ, რომ არ არის საჭირო მთელი ფაილის ჩატვირთვა მეხსიერებაში, რაც განსაკუთრებით მნიშვნელოვანია დიდი ზომის ფაილების შემთხვევაში.
