// 3) აუცილებლად მოიძიეთ ინფორმაცია npm - ის შესახებ, საიდან გვაქვს npm ჩვენს კომპიუტერში, ასევე ახსენით თუ რა არის package.json და რაში ვიყენებთ ჩვენ მას

// NPM (Node Package Manager) არის პაკეტების მენეჯერი, რომელიც გამოიყენება JavaScript-ის პროექტებში, განსაკუთრებით Node.js გარემოში. NPM საშუალებას გვაძლევს მარტივად დავაყენოთ, განვახორციელოთ და გავმართოთ მესამე მხარის ბიბლიოთეკები და ინსტრუმენტები ჩვენს პროექტებში.

// NPM-ის ინსტალაცია ხდება Node.js-ის ინსტალაციასთან ერთად, რადგან NPM არის Node.js-ის ნაწილი. როდესაც თქვენ ჩამოტვირთავთ და დააინსტალირებთ Node.js-ს, NPM ავტომატურად დაინსტალირდება თქვენს სისტემაში.
// package.json არის ფაილი, რომელიც გამოიყენება Node.js პროექტებში და შეიცავს ინფორმაციას პროექტის შესახებ, როგორიცაა პროექტის სახელი, ვერსია, აღწერა, ავტორი და დამოკიდებულებები (dependencies). ეს ფაილი არის JSON ფორმატში და გამოიყენება NPM-ის მიერ პროექტის მართვისთვის.
// package.json ფაილი საშუალებას გვაძლევს მარტივად დავაყენოთ და განვახორციელოთ პროექტის დამოკიდებულებები, რაც უზრუნველყოფს, რომ ყველა საჭირო ბიბლიოთეკა და ინსტრუმენტი იყოს ხელმისაწვდომი პროექტის განვითარებისა და გაშვების დროს.
// package.json ფაილი ასევე შეიცავს სკრიპტებს (scripts), რომლებიც საშუალებას გვაძლევს შევასრულოთ სხვადასხვა დავალებები, როგორიცაა ტესტირება, კომპილაცია და გაშვება, მარტივი ბრძანებების გამოყენებით.

