// 1) შექმენით ერთი ფუნქცია მასში კი ერთი ცვლადი რომელიც ინახავს რაიმე რიცხვს თქვენი დავალებაა რომ კონკრეტული 
// ცვლადის მნიშვნელობა დაბეჭდოთ ფუნქციაშიც და ფუნქციის გარეთაც, კომენტარების სახით ახსენით თუ რა მოხდა და თქვენი 
// აზრით რატომ გამოიწვია ფუნქციის გარეთ ცვლადის მნიშვნელობის დაბეჭდვამ error - ი რა უნდა გააკეთეოთ იმისთვის რომ ეს პრობლემა გადაჭრათ

const myFunc = () => {
    const name = "Saba";
    console.log(name);
};

myFunc();

console.log(name);

// იმის შემდეგ რაც ვცადე ლოკალური ცვლადის გამოყენება (ანუ ცვლადის რომელიც ფუნქციის შიგნით არის) ამოაგდო ერორი რადგან არ შეიძლება ცვლადის რომელიც ეკუთვნის კონკრეტულ კოდის ბლოკს გამოყენება ამ კოდის ბლოკის გარეთ.

