// 2) შექმენით პროექტი Javascript - ის გამოყენებით, თქვენი დავალებაა რომ მოიძიოთ ინფორმაცია DOM - ის შესახებ, შექმენით ერთი ღილაკი 
// მიანიჭეთ მას უნიკალური ID, მოიპოვეთ წვდომა კონკრეტულ ღილაკზე (მოიძიეთ თუ როგორ ხდება წვდომის მოპოვება რაიმე ელემენტზე Javascript - ში) 
// დაუმატეთ მას მოვლენის მსმენელი addEventListener - ის გამოყენებით. მოუსმინეთ 'click' მოვლენას, როდესაც მომხმარებელი დააკლიკებს კონკრეტულ 
// ღილაკს უნდა გამოჩნდეს ტექსტი <h1>Hello World</h1>. მინიშნება: შექმენით ერთი თეგი <h1></h1> რომელიც იქნება ცარიელი, მიანიჭეთ მას უნიკალური 
// ID რადგან შეძლოთ მასზე წვდომის მოპოვება, როდესაც მომხმარებელი ღილაკს დააჭერს მაშინ უნდა შეიცვალოს <h1></h1> თეგის ტექსტის მნიშვნელობა 
// (თავიდან ცარიელი ----> ღილაკზე დაჭერისას'Hello World') ამისთვის მოიძიეთ ინფორმაცია თუ როგორ უნდა შეცვალოთ რაიმე ელემენტის ტექსტის შიგთავსი

let btn = document.getElementById("btn");
let h1 = document.getElementById("h1");

btn.addEventListener("click", () => {
    h1.textContent = 'Hello world';
})

