// 2) შექმენით ერთი ცვლადი სადაც შეინახავთ თქვენს საყვარელ ფილმს, შექმენით ერთი მასივი სადაც გექნებათ ფილმების ჩამონათვალი იმ 
// შემთხვევაში თუ თქვენს მიერ შექმნილი ცვლადის მნიშვნელობა არის მასივში გამოიტანეთ რომ  'It is a good film' იმ შემთხვევაში თუ 
// მომხმარებელის მიერ შემოტანილი ცვლადის მნიშვნელობა არ არის მასივში გამოიტანეთ რომ 'The Film is not good'

const films = ["თინეიჯერი მგელი", "როგორ მოვითვინიეროთ დრაკონი", "შურისმაძიებლები"];

const userFilm = prompt("შეიყვანეთ თქვენი საყვარელი ფილმი");

let bool = false;

for (let i = 0; i < films.length; i++) {
    if (userFilm === films[i]) {
        alert("ეს არის კარგი ფილმი.")
        bool = true
    }
};

if (bool === false) {
    alert("ეს ფილმი არ არის კარგი.")
}

