// 1) თუ ადამიანმა აირჩია მერსედესი მაშინ დავუწეროთ რომ კარგი არჩევანია, იმ შემთხვევაში თუ მომხმარბელემა აირჩია ტესლა მაშინ დავუწეროთ რომ ცუდი არჩევანია, 
// თუ მომხმარებელმა აირჩია ოპელი მაშინ დაუწერეთ რომ საშუალო არჩევანია სხვა შემთხვევაში კი
// ვერ გეტყვი "I can't tell"

const model = prompt("გთხოვთ აირჩიოთ ავტომობილის მოდელი (მერსედესი / ტესლა / ოპელი)")

if (model === "მერსედესი") {
    alert("კარგი არჩევანია.")
} else if (model === "ტესლა") {
    alert("ცუდი არჩევანია.")
} else if (model === "ოპელი") {
    alert("საშუალო არჩევანია.")
} else {
    alert("ვერ გეტყვით.")
}

