// 1) შექმენით tuple typescript ის დახმარებით და ახსენით კომენტარებით რა არის 
// და როგორ მუშაობს ის (რა შემთხვევაში შეიძლება ამოგიგდოთ პრობლემა)

const myTuple: [string, number, boolean, string, number] = ["Saba", 16, true, "Dzidzikashvili", 17];

// tuple - ი არის უცლელი რიცხვთა სიმრავლე, ჩვენ შეგვიძლია დავაკონტკრეტოთ რომელი ელემნეტი რა 
// ტიპის იქნება tuple - ში, ასევე ელემენტეების რაოდენობაც.
// ერორები შეიძლება ამოაგდოს იმ შემთვევაში თუ ჩვენ შევინახავთ არასწორ მონაცემთა ტიპს ამ 
// tuple - ში, ასევე არასწორი რაოდენობის.