// 1) მოიძეთ ინფორმაცია relational Database და Non-relational database, მათი 
// DBMS შესახებაც. შემდეგ კომენტარებით ახსენით განსხვავება მათ შორის, პლიუსები 
// და მინუსები აგრეთვე ახსენით რა არის DBMS

// Relational Database (რელაციური მონაცემთა ბაზა) არის მონაცემთა ბაზა, რომელიც ორგანიზებულია 
// ცხრილების (tables) სახით, სადაც მონაცემები ერთმანეთთან ურთიერთქმედებენ ურთიერთობების (relationships) 
// მეშვეობით. 

// Non-relational Database (არარელაციური მონაცემთა ბაზა) არის მონაცემთა ბაზა, რომელიც არ იყენებს 
// ტრადიციულ ცხრილების სტრუქტურას და ხშირად იყენებს დოკუმენტებს, გრაფებს ან სხვა ფორმატებს მონაცემების 
// შენახვისთვის.

// DBMS (Database Management System) არის პროგრამული უზრუნველყოფა, რომელიც საშუალებას აძლევს მომხმარებლებს
// შექმნან, მართონ და ინტერაქციაში იყვნენ მონაცემთა ბაზებთან. DBMS უზრუნველყოფს მონაცემების ეფექტურად შენახვას, 
// აღდგენას და მართვას.
