// 3) შექმენით ერთი ფაილი სახალად weather.js რომელშიც შექმნით ერთ ფუნქციას მას უნდა გადაეცეს ერთი პარამეტრი hour რომელიც გამოიტანს ამინდს 
// დროის მიხედვით იმ შემთხვევაში თუ საათი არის მეტი ან ტოლი 6 - ის და ნაკლები 12 - ზე გამოიტანეთ sunny თუ საათი არის მეტი ან ტოლი 12 - ის 
// და ნაკლები 18 - ზე გამოიტანეთ rainy სხვა შემთხვევაში კი clear, მინიშნება დაა - export - ეთ მოცემული ფუნქცია და გამოიყენეთ ის მთავარ main.js - ის ფაილში

export function weather(hour) {
    if (hour >= 6 && hour < 12) {
        return "sunny";
    } else if (hour >= 12 && hour < 18) {
        return "rainy";
    } else {
        return "clear";
    }
};

