// 3) შექმენით 2 ფუნქცია პირველის სახელია rectangleArea, triangleArea, პირველი ფუნქცია გამოითვლის სხვადასხვა 
// ოთკუთხედის ფართობს ხოლო მეორე გამოითვლის სამკუთხედის ფართობს, აგრეთვე კოდის დაწერის შემდეგ აუცილებლად 
// ახსენით რა არის პარამეტრი და არგუმენტი (სამკუთხედის ფართობის გამოსათვლელი ფორმულა მოიძიეთ ინტერნეტში)

function rectangleArea(height, width) {
    return height * width
}

function triangleArea(base, height) {
    return (1 / 2) * base * height
}

// პარამეტრი არის ის მონაცემები როდესაც შედის ფუნქციაში მისი შექმნის დროს. (მაგ: height და width)
// არგუმენტი არის ის მონაცემები რომლებიც გადაეცემა ფუნქციას გამოძახების დროს. (მაგ: 10 და 7)

