// 18) შექმენით map მეთოდის manual ფუნქცია, ახსენით თითუელი ეტაპი კომენტარების სახით (მოიძიეთ ინფორმაცია map method - ის შესახებ რადგან უფრო უკეთესად გაიაზროთ)

// იქმნება ფუნქცია სახელად manualMap
const manualMap = (arr, cb) => {
    let newArr = []; // ვქმნით ცარიელ მასივს იმისთვის, რომ მომავალში დავამატოთ აქ ახალი ელემენტები
    for (let i = 0; i < arr.length; i++) { // for ციკლის მეშვეობით გადაუვლით შემოსული მასივის თითოეულ ელემენტს
        newArr.push(cb(arr[i])); // ვამატებთ ჩვენს მასივში ელემენტებს რომლებზეც არის გამოყენებული შემოსული ფუნქცია
    };

    return newArr; // საბოლოოდ ვაბრუნებთ ჩვენს მასივს
};


console.log(manualMap([1, 2, 3, 4, 5, 6, 7, 8, 9], (number) => number * 100)); // ვამოწმებთ მანუალს

