// 1) პირველრიგში ახსენით კომენატრებით რა განსხვავებაა  imperative და declarative პროგრამირების პარადიგმებს შორის თავისი გამალითებით, შემდეგ ახსენით event-driver პროგრამირება რას ნიშნავს.

// imperative პარადიგმა არის ის მომენტი როდესაც ჩვენ კოდში ვხსნით თუ რა უნდა გააკეთოს კოდმა.

// მაგალითად:
const mapManual = (arr, cb) => {
    const result = []

    for (let i = 0; i < arr.length; i++) {
        result.push(cb(arr[i]))
    }

    return result;
}

// declarative პარადიგმა არის ის მომენტი როდესაც ჩვენ უბრალოდ ვასრულებთ რაიმე მოქმედებას და არა ვხსმით მას.

// მაგალითად:
console.log([1, 2, 3].map(item => item * 2));

// event-driver - ი პროგრამირება არის ის მომენტი როდესაც პროგრამა რეაგირებს სხვადასხვა მოვლენებზე (events) როგორიცაა კლიკი, მაუსის გადაადგილება, კლავიატურის დაჭერა და ა.შ.

