// 2) გამოიყენეთ ორჯერ user მეთოდი და გადაეცით შუამავალი ფუნქციები, 
// გამოიყენეთ nextშემდეგი შეუამავლიუ ფუნქციის გამოსაძახებლად

// აუცილებლად ახსენით რა არის შუამავალი ფუნქცია, რა განსხვავებაა use მეთოდსა 
// და სხვა მეთოდებს შორის და რაში გვეხმარება შუამავლი ფუნქციები. (დამატებით 
// ახსენით რას აკეთებს next ფუნქციოა)

// შუამავალი ფუნქცია არის ფუნქცია, რომელიც იღებს request და response 
// ობიექტებს
// შუამავალი ფუნქციები საშუალებას გვაძლევს გავაკონტროლოთ HTTP მოთხოვნებებები 
// და პასუხები
// use მეთოდი რეაგირებს ყველა HTTP მეთოდზე და ყველა როუტზე, ხოლო სხვა 
// მეთოდები (get, post, put, delete) რეაგირებენ კონკრეტულ HTTP მეთოდებზე და როუტებზე
// next ფუნქცია გამოიყენება შუამავალი ფუნქციაში, რათა გადაეცეს კონტროლი
// შემდეგ შუამავალ ფუნქციას

const express = require("express");

const app = express();

app.use((req, res, next) => {
    console.log("First middleware");
    next();
})

app.use((req, res) => {
    console.log("Second middleware");
})

app.listen(3000, () => {
    console.log("Server Started!");
})