// 4) თქვენი დავალებაა while loop - ის გამოყენებით დაითვალოთ თუ რამდენჯერ გვხვდება ასო 'a' ამისთვის:
// შექმენით ერთი ცვალდი სადაც შეინახავთ რაიმე სიტყვას
// შექმენით ერთი ცვალდი სახელად index - ი რომლის თავდაპირველი მნიშვნელობა არის 0 - ის ტოლი
// შექმენით ერთი ცვლადი count ამის მნიშვნელობაც უნდა იყოს 0 - ის ტოლი, ამ ცვლადს თქვენ ქმნით იმისთვის რომ დაითვალოთ თუ რამდენჯერ გვხდება კოკრეტული ასო სიტყვაში

// მინიშნება: ყოველ ჯერზე უნდა დააპლიუსოთ index ცვლადის მნიშვნელობა, საბოლოოდ კი უნდა დაბეჭდოთ თუ რამდენჯერ გვხვდება 'a' ასო სიტყაში

const name = "Saba";

let count = 0;
let index = 0;

while (index <= name.length) {
    if (name[index] === "a") {
        count++;
    };
    index++;
};

console.log(count);

