// 3) გამოიყენეთ fetch ფუნქცია, მოიძიეთ მის შესახებ ინფრომაცია თუ რას აკეთებს და ახსენით კომენტარებით. გააგზავნეთ მოთხოვნა 
// https://fakestoreapi.com/products ამ მისამართზე, დაბრუნებული დაპირება კი მართეთ then და catchმეთოდებით. ახსენით ორივე 
// მეთოდის დანიშნულება + გამოიყენეთ finally მეთოდი (ანალოგიურად ახსენით ამ მეთოდის დანიშნულება)

// fetch ფუნქციით ჩვენ შეგვძლია, რომ გაუგზავნოთ მოთხოვნა რაიმე სერვერს, გვიბრუნდება Promise - ი
fetch("https://fakestoreapi.com/products")
    .then(val => val.json())
    .then(value => console.log("Solved:", value))
    .catch(reason => console.log("Rejected:",reason))
    .finally(() => console.log("Programm is End"));

// then ფუნქციით ჩვენ ვაკონტროლებთ promise - ის წარმატებას, რა მოხდეს თუ კოდი დამთავრდა წარმატებულად.
// catch - ითაც ჩვენ ვაკონტროლებთ promise - ებს ოღონდ ქაჩით ჩვენ ვაკონტროლებთ თუ რა უნდა მოხდეს თუ კოდი დამთავრდა წარუმატებლად.
// finally - გაეშვება ამ ყველაფრის ვოლოს.

