// 7) შექმენით ერთი ფუნქცია რომელსაც გადაეცემა სამი პარამეტრი a, b, c პარამეტრი უნდა იყოს რიცხვი და უნდა იყოს 
// კენტი თქვენმა ფუნქციამ უნდა შეამოწმოს არის თუ არა ამ პარამეტრების საბოლოო ჯამი 15 - ზე მეტი, ფუნქციაში შექმენით 
// ერთი ცვლადი სახელად sum რომლის მნიშვნელობაც თავიდან იქნება 0 - ის ტოლი, შეამოწმეთ იმ შემთხვევაში თუ a 
// პარამეტრი პროცენტული გაყოფით 2 - ზე არ უდრის 0 - ს მაგ შემთხვევაში sum ცვლადის მნიშვნელობა უნდა დააპლიუსოთ
// გააკეთეთ ეს შემოწმება ყველა პარამეტრზე საბოლოოდ კი შეამოწმეთ იმ შემთხვევაში თუ საბოლოო ჯამი sum მნიშვნელობა 
// მეტია 15 ზე დაბეჭდეთ true სხვა შემთხვევაში კი გამოიტანეთ false - ი 

function myFunc(a, b, c) {
    let sum = 0
    
    if (a % 2 != 0) {
        sum += a
    }

    if (b % 2 != 0) {
        sum += b
    }

    if (c % 2 != 0) {
        sum += c
    }

    if (sum > 15) {
        return true
    } else {
        return false
    }
}

console.log(myFunc(5, 5, 7))

