// 2) შექმენით js ფაილი დაწერეთ პატარ პროგრამა მაგ: მასივის ფილტრაციოა for ციკლის გამოყენებით და გაუშვით Node.js დახმარებით 
// (თუ გინდათ შეამოწმეთ task manager) (აუცილებლად ახსენით კომენტარებით რა არის გამშვები გარემო, რამდენი გამშვები გარემო გვაქვს, რა არის REPL) 
// აგრეთვე გატესტეთ repl მუშაობაც ტერმინალში უბრალოდ ბრძანება node ით 

const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

let newArr = [];

for (let i = 0; i < arr.length; i++) {
    if (arr[i] % 2 === 0) {
        newArr.push(arr[i]);
    };
};

console.log(arr);
console.log(newArr);

